{
  "title": "Older Adults Imagining Future Technologies in Participatory Design Workshops: Supporting Continuity in the Pursuit of Meaningful Activities",
  "doi": "100/33333",
  "content": "introduction: In 1997, Rowe and Kahn defined successful aging as comprising three main components: low probability of disease-related disability, high cognitive and physical abilities, and meaningful engagement with life [78]. Over the past few decades, the advancement of digital technologies has revolutionised the lives of older adults, covering a spectrum from clinical innovation to shaping the everyday life experiences of individuals. Digital technologies are increasingly seen as essential for maintaining older adults’ social connectedness [11, 87], social participation [7, 9], and engagement in meaningful activities [67, 93]. Older adults’ spaces for meaningful engagement are not limited to the physical but are open to wider digital environments where they can learn, grow, socialise, and improve their quality of life [83, 92]. Through online platforms, older adults can take up new hobbies, learn new skills, connect with like-minded people, and participate in a range of local and far-flung activities [92].\nRecent research in Human-Computer Interaction (HCI) has highlighted the value of engaging and empowering older adults in the design and use of creative technologies [57, 77]. Many studies have challenged stereotypes that position older adults as non-users of technologies or resistant to new technologies [12, 42]. Rather, engaging older adults in the design process can spark their creativity and wisdom and reflect the diverse range of skills they have gained through life experience, contributing to the invention of future technologies [70, 77]. Older adults have been invited to participate in, among other innovations, the design and use of virtual reality (VR) and 3D avatars [10], Internet of Things (IoT) systems [70], conversational agents such as Google Home and Alexa [94], healthcare systems [26, 38], and robots [3]. Yet, there is still limited investigation of how these emerging technologies can support or expand older adults’ engagement in meaningful activities that bring value to people and help them achieve their goals or purposes in life, such as pursuing hobbies, volunteering, civic participation, and lifelong learning [36, 68, 92]. We see an opportunity to investigate older adults’ interpretations of meaningful activities and perceptions of using different technologies to support these activities. Understanding these aspects can inform future technology design by provoking critical reflections on the benefits and limitations of digital technology for older people and identifying the values and attributes they desire when interacting with technology.\nIn this paper, we aim to examine how older adults: (1) perceive the use of existing and emerging technologies for supporting meaningful activities in later life, and (2) imagine future technologies that can support or expand their engagement in meaningful activities. To achieve this, we conducted participatory design workshops with 16 older adults aged 67-84 and living independently in their homes. The workshops involved focus group discussions, hands-on experience with technologies, brainstorming, prototyping, and storyboarding. We also conducted follow-up interviews with 10 workshop participants.\nOur findings show that participants had various experiences of meaningful activities, including personal hobbies and interests, social interactions, physical activities, learning and enriching experiences, and entertainment and relaxation. In assessing how different technologies can be used to support these activities, participants expressed discerning attitudes towards when and how to use them and the potential harms of certain technologies. Participants’ visions of future technologies revealed a shift in focus from meaningful activities to enabling safe aging at home, which was seen as a pathway for pursuing meaningful activities in later stages of life. Their design ideas revealed several values and attributes they desire in future technologies, including simplicity, positivity, proactivity, and integration. The findings were further interpreted through a lens of Continuity Theory [4], which suggests that people strive to maintain a consistent sense of self and a level of continuity in their lives, values, and activities as they adapt to the aging process.\nOur study contributes to existing HCI research through a central argument that older adults seek to retain continuity as they envision the future design of technology for supporting meaningful activities in later life. This includes a desire to use technologies to maintain established patterns of meaningful activities, to expand and improve existing systems to create enhanced experiences, and to extend the continuity into the future when their capabilities are threatened by age-related factors. We argue that there is no one-size-fits-all design solution that can support older adults’ engagement in meaningful activities. Based on these insights, we propose four lessons and opportunities. Future technology design and research for older adults could explore: 1) designing for continuity in meaningful activities; 2) integrating social elements into IoT systems; 3) using AI as digital coaches for learning support; and 4) embracing the complexity of values in technology design."
}




