{
  "title": "(Un)making AI Magic: A Design Taxonomy",
  "doi": "100/11111",
  "content": "doi: '100/11111' As the science fiction writer Bruce Sterling emphasizes, there is a discourse of great excitement and wonder about all the novel artificial intelligence (AI) algorithms and applications that have been launched in the last years – a Mardi Gras of AI[114]. After the last winter, the current spring [43] of AI tools is now being leveraged to speed up and enhance a multitude of works, especially in creative practices where applications range from idea exploration [22, 66, 68] and ideation [128] to project documentation [21], creative partnership [71, 86], and so on.\nAI has always been a metaphor-driven field [2], and the search for useful metaphors that articulate the possibilities of technology has a hand in shaping the field [7, 65]. As these tools are adopted, along with wonder and excitement, we see a metaphorical vocabulary that stems from the world of the supernatural and emphasizes the ‘magical and enchanting’ nature of these technologies. As an illustration, Derczynski [31] reports on a series of recurring terms used by a variety of professionals that show this metaphorical link to magic, such as spellcasting for providing or developing an input to a prompted language model; alchemy, to describe a practice of constructing model inputs to discover the different model outputs they lead to; invoking, to change the characteristics of a model output; and more.\nSuch a tendency to use the language of magic is not new – “it is often the case that new technologies are presented as magical” [18]. However, around AI tendencies towards magical thinking are emphasized as computer programs are seen to carry out tasks that were once unimaginable for computers to do [108]; to have skills that were once thought to be exclusive of humans [87], e.g., to converse [57] and express creativity [38, 76, 88]. The term artificial intelligence – particularly in contrast to alternatives such as ‘complex information processing systems’ [61] – invites us to attribute typically human properties such as “thought, imagination, memory, will, sensation, perception, belief, desire, intention, or feelings” to AI systems and products in which they are embedded [24]. Such emphasis on replication of human intelligence, and the ease with which we over-attribute abilities to computational systems, means that AI has now “come to have overtones of trickery” [125] as we discuss for example the gap between being able to produce sentences and actually understanding language [9].\nHere, we work with the idea of enchantment: “the experience of being caught up and carried away”, where our attention is captured, we are “charmed and disturbed”, and our “background sense of order has flown out the door” [12]. Contemporary AI algorithms, especially deep learning, have a particular power to enchant. They embody a level of complexity that is hard for experts – let alone the general public – to grasp [18]. This complexity renders AI algorithms inherently opaque [5, 74, 96], in their structure, their internal patterns, and their links to the world [39]: “when a computer learns and consequently builds its own representation of a classification decision, it does so without regard for human comprehension” [16]. This gap of comprehension is the space through which magic flows [4], opening space for ambiguity and unexpectedness, and leading to truly enchanting experiences [85].\nThe language of magic and superhuman abilities is purposefully embraced by tech industries to build a public imaginary of AI as a silver bullet [73, 122] for solving all problems. As some examples: Future Tools [118] “collects & organizes all the best AI tools so you too can become superhuman!”; Google’s new text feature for the Chrome browser is called Magical [81]; Figma’s AI toolset is called Magician [42]: “Every little thing it does is magic. A magical design tool for Figma powered by AI.”; and Runway AI [106] introduces its AI tools with the header: “AI Magic Tools. Dozens of creative tools to ideate, generate and edit content like never before”. However, as well as generating “interest in the field, spur[ing] financial investment, and trigger[ing] research and development”, this language also contributes to obfuscating the actual practices involved in the ‘making’ of AI systems [36]; it disproportionately emphasizes the possibilities and opportunities offered by AI rather than its actual functionalities, blurring the line between the fantasy and the reality of these technologies [36]. Designing and communicating AI things as supernatural–enchanted–products, in fact, shapes the social perceptions of these systems, taking them out of the realm of mere technical tools to be regarded as socially capable agents [113] and/or socially valuable applications [18]. Building on Bennett’s development of enchantment [12], Campolo and Crawford [18] define this phenomenon as enchanted determinism: “a discourse that presents AI, and deep learning techniques especially, as magical, thus outside the scope of present scientific knowledge, yet also deterministic, in the sense that AI algorithms can nonetheless detect patterns that give unprecedented access to people’s identities, emotions, and social character”. Working in this magical domain allows designers to focus on mastery of the illusions that they create [113] while minimizing concern for the consequences they cause [18, 36].\nThis paper investigates the ways in which design can contribute to increasing and decreasing the sense of enchantment in experiences with AI products, supporting an understanding of the dynamics and effects of magical thinking in the design of AI things. We do this by building a taxonomy of design principles that engage with magic and AI in the creation of interactive products. The taxonomy is based on a combination of theoretical development and critical reflection on two years of the Interactive Technology Design Master’s course held at Delft University of Technology (TU Delft) between the years 2021 and 2023. While student work may not represent the full landscape and richness of AI things we can design, it gives a unique window into the conceptual development of designers who are engaging with AI. We reflected upon students’ projects following the notions of enchantment and disenchantment, and used these to iterate on our taxonomy, developing a set of archetypal principles that contribute to creating AI-based products and services. We expand the discussion of these by articulating how designers can approach and appropriate the taxonomy in their practice."
}

